; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f54-p5-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 f12 f13 f14 f15 f16 f17 f18 f19 
             f20 f21 f22 f23 f24 f25 f26 f27 f28 f29 
             f30 f31 f32 f33 f34 f35 f36 f37 f38 f39 
             f40 f41 f42 f43 f44 f45 f46 f47 f48 f49 
             f50 f51 f52 f53 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)
(above f0 f12)
(above f0 f13)
(above f0 f14)
(above f0 f15)
(above f0 f16)
(above f0 f17)
(above f0 f18)
(above f0 f19)
(above f0 f20)
(above f0 f21)
(above f0 f22)
(above f0 f23)
(above f0 f24)
(above f0 f25)
(above f0 f26)
(above f0 f27)
(above f0 f28)
(above f0 f29)
(above f0 f30)
(above f0 f31)
(above f0 f32)
(above f0 f33)
(above f0 f34)
(above f0 f35)
(above f0 f36)
(above f0 f37)
(above f0 f38)
(above f0 f39)
(above f0 f40)
(above f0 f41)
(above f0 f42)
(above f0 f43)
(above f0 f44)
(above f0 f45)
(above f0 f46)
(above f0 f47)
(above f0 f48)
(above f0 f49)
(above f0 f50)
(above f0 f51)
(above f0 f52)
(above f0 f53)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)
(above f1 f12)
(above f1 f13)
(above f1 f14)
(above f1 f15)
(above f1 f16)
(above f1 f17)
(above f1 f18)
(above f1 f19)
(above f1 f20)
(above f1 f21)
(above f1 f22)
(above f1 f23)
(above f1 f24)
(above f1 f25)
(above f1 f26)
(above f1 f27)
(above f1 f28)
(above f1 f29)
(above f1 f30)
(above f1 f31)
(above f1 f32)
(above f1 f33)
(above f1 f34)
(above f1 f35)
(above f1 f36)
(above f1 f37)
(above f1 f38)
(above f1 f39)
(above f1 f40)
(above f1 f41)
(above f1 f42)
(above f1 f43)
(above f1 f44)
(above f1 f45)
(above f1 f46)
(above f1 f47)
(above f1 f48)
(above f1 f49)
(above f1 f50)
(above f1 f51)
(above f1 f52)
(above f1 f53)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)
(above f2 f12)
(above f2 f13)
(above f2 f14)
(above f2 f15)
(above f2 f16)
(above f2 f17)
(above f2 f18)
(above f2 f19)
(above f2 f20)
(above f2 f21)
(above f2 f22)
(above f2 f23)
(above f2 f24)
(above f2 f25)
(above f2 f26)
(above f2 f27)
(above f2 f28)
(above f2 f29)
(above f2 f30)
(above f2 f31)
(above f2 f32)
(above f2 f33)
(above f2 f34)
(above f2 f35)
(above f2 f36)
(above f2 f37)
(above f2 f38)
(above f2 f39)
(above f2 f40)
(above f2 f41)
(above f2 f42)
(above f2 f43)
(above f2 f44)
(above f2 f45)
(above f2 f46)
(above f2 f47)
(above f2 f48)
(above f2 f49)
(above f2 f50)
(above f2 f51)
(above f2 f52)
(above f2 f53)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)
(above f3 f12)
(above f3 f13)
(above f3 f14)
(above f3 f15)
(above f3 f16)
(above f3 f17)
(above f3 f18)
(above f3 f19)
(above f3 f20)
(above f3 f21)
(above f3 f22)
(above f3 f23)
(above f3 f24)
(above f3 f25)
(above f3 f26)
(above f3 f27)
(above f3 f28)
(above f3 f29)
(above f3 f30)
(above f3 f31)
(above f3 f32)
(above f3 f33)
(above f3 f34)
(above f3 f35)
(above f3 f36)
(above f3 f37)
(above f3 f38)
(above f3 f39)
(above f3 f40)
(above f3 f41)
(above f3 f42)
(above f3 f43)
(above f3 f44)
(above f3 f45)
(above f3 f46)
(above f3 f47)
(above f3 f48)
(above f3 f49)
(above f3 f50)
(above f3 f51)
(above f3 f52)
(above f3 f53)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)
(above f4 f12)
(above f4 f13)
(above f4 f14)
(above f4 f15)
(above f4 f16)
(above f4 f17)
(above f4 f18)
(above f4 f19)
(above f4 f20)
(above f4 f21)
(above f4 f22)
(above f4 f23)
(above f4 f24)
(above f4 f25)
(above f4 f26)
(above f4 f27)
(above f4 f28)
(above f4 f29)
(above f4 f30)
(above f4 f31)
(above f4 f32)
(above f4 f33)
(above f4 f34)
(above f4 f35)
(above f4 f36)
(above f4 f37)
(above f4 f38)
(above f4 f39)
(above f4 f40)
(above f4 f41)
(above f4 f42)
(above f4 f43)
(above f4 f44)
(above f4 f45)
(above f4 f46)
(above f4 f47)
(above f4 f48)
(above f4 f49)
(above f4 f50)
(above f4 f51)
(above f4 f52)
(above f4 f53)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)
(above f5 f12)
(above f5 f13)
(above f5 f14)
(above f5 f15)
(above f5 f16)
(above f5 f17)
(above f5 f18)
(above f5 f19)
(above f5 f20)
(above f5 f21)
(above f5 f22)
(above f5 f23)
(above f5 f24)
(above f5 f25)
(above f5 f26)
(above f5 f27)
(above f5 f28)
(above f5 f29)
(above f5 f30)
(above f5 f31)
(above f5 f32)
(above f5 f33)
(above f5 f34)
(above f5 f35)
(above f5 f36)
(above f5 f37)
(above f5 f38)
(above f5 f39)
(above f5 f40)
(above f5 f41)
(above f5 f42)
(above f5 f43)
(above f5 f44)
(above f5 f45)
(above f5 f46)
(above f5 f47)
(above f5 f48)
(above f5 f49)
(above f5 f50)
(above f5 f51)
(above f5 f52)
(above f5 f53)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)
(above f6 f12)
(above f6 f13)
(above f6 f14)
(above f6 f15)
(above f6 f16)
(above f6 f17)
(above f6 f18)
(above f6 f19)
(above f6 f20)
(above f6 f21)
(above f6 f22)
(above f6 f23)
(above f6 f24)
(above f6 f25)
(above f6 f26)
(above f6 f27)
(above f6 f28)
(above f6 f29)
(above f6 f30)
(above f6 f31)
(above f6 f32)
(above f6 f33)
(above f6 f34)
(above f6 f35)
(above f6 f36)
(above f6 f37)
(above f6 f38)
(above f6 f39)
(above f6 f40)
(above f6 f41)
(above f6 f42)
(above f6 f43)
(above f6 f44)
(above f6 f45)
(above f6 f46)
(above f6 f47)
(above f6 f48)
(above f6 f49)
(above f6 f50)
(above f6 f51)
(above f6 f52)
(above f6 f53)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)
(above f7 f12)
(above f7 f13)
(above f7 f14)
(above f7 f15)
(above f7 f16)
(above f7 f17)
(above f7 f18)
(above f7 f19)
(above f7 f20)
(above f7 f21)
(above f7 f22)
(above f7 f23)
(above f7 f24)
(above f7 f25)
(above f7 f26)
(above f7 f27)
(above f7 f28)
(above f7 f29)
(above f7 f30)
(above f7 f31)
(above f7 f32)
(above f7 f33)
(above f7 f34)
(above f7 f35)
(above f7 f36)
(above f7 f37)
(above f7 f38)
(above f7 f39)
(above f7 f40)
(above f7 f41)
(above f7 f42)
(above f7 f43)
(above f7 f44)
(above f7 f45)
(above f7 f46)
(above f7 f47)
(above f7 f48)
(above f7 f49)
(above f7 f50)
(above f7 f51)
(above f7 f52)
(above f7 f53)

(above f8 f9)
(above f8 f10)
(above f8 f11)
(above f8 f12)
(above f8 f13)
(above f8 f14)
(above f8 f15)
(above f8 f16)
(above f8 f17)
(above f8 f18)
(above f8 f19)
(above f8 f20)
(above f8 f21)
(above f8 f22)
(above f8 f23)
(above f8 f24)
(above f8 f25)
(above f8 f26)
(above f8 f27)
(above f8 f28)
(above f8 f29)
(above f8 f30)
(above f8 f31)
(above f8 f32)
(above f8 f33)
(above f8 f34)
(above f8 f35)
(above f8 f36)
(above f8 f37)
(above f8 f38)
(above f8 f39)
(above f8 f40)
(above f8 f41)
(above f8 f42)
(above f8 f43)
(above f8 f44)
(above f8 f45)
(above f8 f46)
(above f8 f47)
(above f8 f48)
(above f8 f49)
(above f8 f50)
(above f8 f51)
(above f8 f52)
(above f8 f53)

(above f9 f10)
(above f9 f11)
(above f9 f12)
(above f9 f13)
(above f9 f14)
(above f9 f15)
(above f9 f16)
(above f9 f17)
(above f9 f18)
(above f9 f19)
(above f9 f20)
(above f9 f21)
(above f9 f22)
(above f9 f23)
(above f9 f24)
(above f9 f25)
(above f9 f26)
(above f9 f27)
(above f9 f28)
(above f9 f29)
(above f9 f30)
(above f9 f31)
(above f9 f32)
(above f9 f33)
(above f9 f34)
(above f9 f35)
(above f9 f36)
(above f9 f37)
(above f9 f38)
(above f9 f39)
(above f9 f40)
(above f9 f41)
(above f9 f42)
(above f9 f43)
(above f9 f44)
(above f9 f45)
(above f9 f46)
(above f9 f47)
(above f9 f48)
(above f9 f49)
(above f9 f50)
(above f9 f51)
(above f9 f52)
(above f9 f53)

(above f10 f11)
(above f10 f12)
(above f10 f13)
(above f10 f14)
(above f10 f15)
(above f10 f16)
(above f10 f17)
(above f10 f18)
(above f10 f19)
(above f10 f20)
(above f10 f21)
(above f10 f22)
(above f10 f23)
(above f10 f24)
(above f10 f25)
(above f10 f26)
(above f10 f27)
(above f10 f28)
(above f10 f29)
(above f10 f30)
(above f10 f31)
(above f10 f32)
(above f10 f33)
(above f10 f34)
(above f10 f35)
(above f10 f36)
(above f10 f37)
(above f10 f38)
(above f10 f39)
(above f10 f40)
(above f10 f41)
(above f10 f42)
(above f10 f43)
(above f10 f44)
(above f10 f45)
(above f10 f46)
(above f10 f47)
(above f10 f48)
(above f10 f49)
(above f10 f50)
(above f10 f51)
(above f10 f52)
(above f10 f53)

(above f11 f12)
(above f11 f13)
(above f11 f14)
(above f11 f15)
(above f11 f16)
(above f11 f17)
(above f11 f18)
(above f11 f19)
(above f11 f20)
(above f11 f21)
(above f11 f22)
(above f11 f23)
(above f11 f24)
(above f11 f25)
(above f11 f26)
(above f11 f27)
(above f11 f28)
(above f11 f29)
(above f11 f30)
(above f11 f31)
(above f11 f32)
(above f11 f33)
(above f11 f34)
(above f11 f35)
(above f11 f36)
(above f11 f37)
(above f11 f38)
(above f11 f39)
(above f11 f40)
(above f11 f41)
(above f11 f42)
(above f11 f43)
(above f11 f44)
(above f11 f45)
(above f11 f46)
(above f11 f47)
(above f11 f48)
(above f11 f49)
(above f11 f50)
(above f11 f51)
(above f11 f52)
(above f11 f53)

(above f12 f13)
(above f12 f14)
(above f12 f15)
(above f12 f16)
(above f12 f17)
(above f12 f18)
(above f12 f19)
(above f12 f20)
(above f12 f21)
(above f12 f22)
(above f12 f23)
(above f12 f24)
(above f12 f25)
(above f12 f26)
(above f12 f27)
(above f12 f28)
(above f12 f29)
(above f12 f30)
(above f12 f31)
(above f12 f32)
(above f12 f33)
(above f12 f34)
(above f12 f35)
(above f12 f36)
(above f12 f37)
(above f12 f38)
(above f12 f39)
(above f12 f40)
(above f12 f41)
(above f12 f42)
(above f12 f43)
(above f12 f44)
(above f12 f45)
(above f12 f46)
(above f12 f47)
(above f12 f48)
(above f12 f49)
(above f12 f50)
(above f12 f51)
(above f12 f52)
(above f12 f53)

(above f13 f14)
(above f13 f15)
(above f13 f16)
(above f13 f17)
(above f13 f18)
(above f13 f19)
(above f13 f20)
(above f13 f21)
(above f13 f22)
(above f13 f23)
(above f13 f24)
(above f13 f25)
(above f13 f26)
(above f13 f27)
(above f13 f28)
(above f13 f29)
(above f13 f30)
(above f13 f31)
(above f13 f32)
(above f13 f33)
(above f13 f34)
(above f13 f35)
(above f13 f36)
(above f13 f37)
(above f13 f38)
(above f13 f39)
(above f13 f40)
(above f13 f41)
(above f13 f42)
(above f13 f43)
(above f13 f44)
(above f13 f45)
(above f13 f46)
(above f13 f47)
(above f13 f48)
(above f13 f49)
(above f13 f50)
(above f13 f51)
(above f13 f52)
(above f13 f53)

(above f14 f15)
(above f14 f16)
(above f14 f17)
(above f14 f18)
(above f14 f19)
(above f14 f20)
(above f14 f21)
(above f14 f22)
(above f14 f23)
(above f14 f24)
(above f14 f25)
(above f14 f26)
(above f14 f27)
(above f14 f28)
(above f14 f29)
(above f14 f30)
(above f14 f31)
(above f14 f32)
(above f14 f33)
(above f14 f34)
(above f14 f35)
(above f14 f36)
(above f14 f37)
(above f14 f38)
(above f14 f39)
(above f14 f40)
(above f14 f41)
(above f14 f42)
(above f14 f43)
(above f14 f44)
(above f14 f45)
(above f14 f46)
(above f14 f47)
(above f14 f48)
(above f14 f49)
(above f14 f50)
(above f14 f51)
(above f14 f52)
(above f14 f53)

(above f15 f16)
(above f15 f17)
(above f15 f18)
(above f15 f19)
(above f15 f20)
(above f15 f21)
(above f15 f22)
(above f15 f23)
(above f15 f24)
(above f15 f25)
(above f15 f26)
(above f15 f27)
(above f15 f28)
(above f15 f29)
(above f15 f30)
(above f15 f31)
(above f15 f32)
(above f15 f33)
(above f15 f34)
(above f15 f35)
(above f15 f36)
(above f15 f37)
(above f15 f38)
(above f15 f39)
(above f15 f40)
(above f15 f41)
(above f15 f42)
(above f15 f43)
(above f15 f44)
(above f15 f45)
(above f15 f46)
(above f15 f47)
(above f15 f48)
(above f15 f49)
(above f15 f50)
(above f15 f51)
(above f15 f52)
(above f15 f53)

(above f16 f17)
(above f16 f18)
(above f16 f19)
(above f16 f20)
(above f16 f21)
(above f16 f22)
(above f16 f23)
(above f16 f24)
(above f16 f25)
(above f16 f26)
(above f16 f27)
(above f16 f28)
(above f16 f29)
(above f16 f30)
(above f16 f31)
(above f16 f32)
(above f16 f33)
(above f16 f34)
(above f16 f35)
(above f16 f36)
(above f16 f37)
(above f16 f38)
(above f16 f39)
(above f16 f40)
(above f16 f41)
(above f16 f42)
(above f16 f43)
(above f16 f44)
(above f16 f45)
(above f16 f46)
(above f16 f47)
(above f16 f48)
(above f16 f49)
(above f16 f50)
(above f16 f51)
(above f16 f52)
(above f16 f53)

(above f17 f18)
(above f17 f19)
(above f17 f20)
(above f17 f21)
(above f17 f22)
(above f17 f23)
(above f17 f24)
(above f17 f25)
(above f17 f26)
(above f17 f27)
(above f17 f28)
(above f17 f29)
(above f17 f30)
(above f17 f31)
(above f17 f32)
(above f17 f33)
(above f17 f34)
(above f17 f35)
(above f17 f36)
(above f17 f37)
(above f17 f38)
(above f17 f39)
(above f17 f40)
(above f17 f41)
(above f17 f42)
(above f17 f43)
(above f17 f44)
(above f17 f45)
(above f17 f46)
(above f17 f47)
(above f17 f48)
(above f17 f49)
(above f17 f50)
(above f17 f51)
(above f17 f52)
(above f17 f53)

(above f18 f19)
(above f18 f20)
(above f18 f21)
(above f18 f22)
(above f18 f23)
(above f18 f24)
(above f18 f25)
(above f18 f26)
(above f18 f27)
(above f18 f28)
(above f18 f29)
(above f18 f30)
(above f18 f31)
(above f18 f32)
(above f18 f33)
(above f18 f34)
(above f18 f35)
(above f18 f36)
(above f18 f37)
(above f18 f38)
(above f18 f39)
(above f18 f40)
(above f18 f41)
(above f18 f42)
(above f18 f43)
(above f18 f44)
(above f18 f45)
(above f18 f46)
(above f18 f47)
(above f18 f48)
(above f18 f49)
(above f18 f50)
(above f18 f51)
(above f18 f52)
(above f18 f53)

(above f19 f20)
(above f19 f21)
(above f19 f22)
(above f19 f23)
(above f19 f24)
(above f19 f25)
(above f19 f26)
(above f19 f27)
(above f19 f28)
(above f19 f29)
(above f19 f30)
(above f19 f31)
(above f19 f32)
(above f19 f33)
(above f19 f34)
(above f19 f35)
(above f19 f36)
(above f19 f37)
(above f19 f38)
(above f19 f39)
(above f19 f40)
(above f19 f41)
(above f19 f42)
(above f19 f43)
(above f19 f44)
(above f19 f45)
(above f19 f46)
(above f19 f47)
(above f19 f48)
(above f19 f49)
(above f19 f50)
(above f19 f51)
(above f19 f52)
(above f19 f53)

(above f20 f21)
(above f20 f22)
(above f20 f23)
(above f20 f24)
(above f20 f25)
(above f20 f26)
(above f20 f27)
(above f20 f28)
(above f20 f29)
(above f20 f30)
(above f20 f31)
(above f20 f32)
(above f20 f33)
(above f20 f34)
(above f20 f35)
(above f20 f36)
(above f20 f37)
(above f20 f38)
(above f20 f39)
(above f20 f40)
(above f20 f41)
(above f20 f42)
(above f20 f43)
(above f20 f44)
(above f20 f45)
(above f20 f46)
(above f20 f47)
(above f20 f48)
(above f20 f49)
(above f20 f50)
(above f20 f51)
(above f20 f52)
(above f20 f53)

(above f21 f22)
(above f21 f23)
(above f21 f24)
(above f21 f25)
(above f21 f26)
(above f21 f27)
(above f21 f28)
(above f21 f29)
(above f21 f30)
(above f21 f31)
(above f21 f32)
(above f21 f33)
(above f21 f34)
(above f21 f35)
(above f21 f36)
(above f21 f37)
(above f21 f38)
(above f21 f39)
(above f21 f40)
(above f21 f41)
(above f21 f42)
(above f21 f43)
(above f21 f44)
(above f21 f45)
(above f21 f46)
(above f21 f47)
(above f21 f48)
(above f21 f49)
(above f21 f50)
(above f21 f51)
(above f21 f52)
(above f21 f53)

(above f22 f23)
(above f22 f24)
(above f22 f25)
(above f22 f26)
(above f22 f27)
(above f22 f28)
(above f22 f29)
(above f22 f30)
(above f22 f31)
(above f22 f32)
(above f22 f33)
(above f22 f34)
(above f22 f35)
(above f22 f36)
(above f22 f37)
(above f22 f38)
(above f22 f39)
(above f22 f40)
(above f22 f41)
(above f22 f42)
(above f22 f43)
(above f22 f44)
(above f22 f45)
(above f22 f46)
(above f22 f47)
(above f22 f48)
(above f22 f49)
(above f22 f50)
(above f22 f51)
(above f22 f52)
(above f22 f53)

(above f23 f24)
(above f23 f25)
(above f23 f26)
(above f23 f27)
(above f23 f28)
(above f23 f29)
(above f23 f30)
(above f23 f31)
(above f23 f32)
(above f23 f33)
(above f23 f34)
(above f23 f35)
(above f23 f36)
(above f23 f37)
(above f23 f38)
(above f23 f39)
(above f23 f40)
(above f23 f41)
(above f23 f42)
(above f23 f43)
(above f23 f44)
(above f23 f45)
(above f23 f46)
(above f23 f47)
(above f23 f48)
(above f23 f49)
(above f23 f50)
(above f23 f51)
(above f23 f52)
(above f23 f53)

(above f24 f25)
(above f24 f26)
(above f24 f27)
(above f24 f28)
(above f24 f29)
(above f24 f30)
(above f24 f31)
(above f24 f32)
(above f24 f33)
(above f24 f34)
(above f24 f35)
(above f24 f36)
(above f24 f37)
(above f24 f38)
(above f24 f39)
(above f24 f40)
(above f24 f41)
(above f24 f42)
(above f24 f43)
(above f24 f44)
(above f24 f45)
(above f24 f46)
(above f24 f47)
(above f24 f48)
(above f24 f49)
(above f24 f50)
(above f24 f51)
(above f24 f52)
(above f24 f53)

(above f25 f26)
(above f25 f27)
(above f25 f28)
(above f25 f29)
(above f25 f30)
(above f25 f31)
(above f25 f32)
(above f25 f33)
(above f25 f34)
(above f25 f35)
(above f25 f36)
(above f25 f37)
(above f25 f38)
(above f25 f39)
(above f25 f40)
(above f25 f41)
(above f25 f42)
(above f25 f43)
(above f25 f44)
(above f25 f45)
(above f25 f46)
(above f25 f47)
(above f25 f48)
(above f25 f49)
(above f25 f50)
(above f25 f51)
(above f25 f52)
(above f25 f53)

(above f26 f27)
(above f26 f28)
(above f26 f29)
(above f26 f30)
(above f26 f31)
(above f26 f32)
(above f26 f33)
(above f26 f34)
(above f26 f35)
(above f26 f36)
(above f26 f37)
(above f26 f38)
(above f26 f39)
(above f26 f40)
(above f26 f41)
(above f26 f42)
(above f26 f43)
(above f26 f44)
(above f26 f45)
(above f26 f46)
(above f26 f47)
(above f26 f48)
(above f26 f49)
(above f26 f50)
(above f26 f51)
(above f26 f52)
(above f26 f53)

(above f27 f28)
(above f27 f29)
(above f27 f30)
(above f27 f31)
(above f27 f32)
(above f27 f33)
(above f27 f34)
(above f27 f35)
(above f27 f36)
(above f27 f37)
(above f27 f38)
(above f27 f39)
(above f27 f40)
(above f27 f41)
(above f27 f42)
(above f27 f43)
(above f27 f44)
(above f27 f45)
(above f27 f46)
(above f27 f47)
(above f27 f48)
(above f27 f49)
(above f27 f50)
(above f27 f51)
(above f27 f52)
(above f27 f53)

(above f28 f29)
(above f28 f30)
(above f28 f31)
(above f28 f32)
(above f28 f33)
(above f28 f34)
(above f28 f35)
(above f28 f36)
(above f28 f37)
(above f28 f38)
(above f28 f39)
(above f28 f40)
(above f28 f41)
(above f28 f42)
(above f28 f43)
(above f28 f44)
(above f28 f45)
(above f28 f46)
(above f28 f47)
(above f28 f48)
(above f28 f49)
(above f28 f50)
(above f28 f51)
(above f28 f52)
(above f28 f53)

(above f29 f30)
(above f29 f31)
(above f29 f32)
(above f29 f33)
(above f29 f34)
(above f29 f35)
(above f29 f36)
(above f29 f37)
(above f29 f38)
(above f29 f39)
(above f29 f40)
(above f29 f41)
(above f29 f42)
(above f29 f43)
(above f29 f44)
(above f29 f45)
(above f29 f46)
(above f29 f47)
(above f29 f48)
(above f29 f49)
(above f29 f50)
(above f29 f51)
(above f29 f52)
(above f29 f53)

(above f30 f31)
(above f30 f32)
(above f30 f33)
(above f30 f34)
(above f30 f35)
(above f30 f36)
(above f30 f37)
(above f30 f38)
(above f30 f39)
(above f30 f40)
(above f30 f41)
(above f30 f42)
(above f30 f43)
(above f30 f44)
(above f30 f45)
(above f30 f46)
(above f30 f47)
(above f30 f48)
(above f30 f49)
(above f30 f50)
(above f30 f51)
(above f30 f52)
(above f30 f53)

(above f31 f32)
(above f31 f33)
(above f31 f34)
(above f31 f35)
(above f31 f36)
(above f31 f37)
(above f31 f38)
(above f31 f39)
(above f31 f40)
(above f31 f41)
(above f31 f42)
(above f31 f43)
(above f31 f44)
(above f31 f45)
(above f31 f46)
(above f31 f47)
(above f31 f48)
(above f31 f49)
(above f31 f50)
(above f31 f51)
(above f31 f52)
(above f31 f53)

(above f32 f33)
(above f32 f34)
(above f32 f35)
(above f32 f36)
(above f32 f37)
(above f32 f38)
(above f32 f39)
(above f32 f40)
(above f32 f41)
(above f32 f42)
(above f32 f43)
(above f32 f44)
(above f32 f45)
(above f32 f46)
(above f32 f47)
(above f32 f48)
(above f32 f49)
(above f32 f50)
(above f32 f51)
(above f32 f52)
(above f32 f53)

(above f33 f34)
(above f33 f35)
(above f33 f36)
(above f33 f37)
(above f33 f38)
(above f33 f39)
(above f33 f40)
(above f33 f41)
(above f33 f42)
(above f33 f43)
(above f33 f44)
(above f33 f45)
(above f33 f46)
(above f33 f47)
(above f33 f48)
(above f33 f49)
(above f33 f50)
(above f33 f51)
(above f33 f52)
(above f33 f53)

(above f34 f35)
(above f34 f36)
(above f34 f37)
(above f34 f38)
(above f34 f39)
(above f34 f40)
(above f34 f41)
(above f34 f42)
(above f34 f43)
(above f34 f44)
(above f34 f45)
(above f34 f46)
(above f34 f47)
(above f34 f48)
(above f34 f49)
(above f34 f50)
(above f34 f51)
(above f34 f52)
(above f34 f53)

(above f35 f36)
(above f35 f37)
(above f35 f38)
(above f35 f39)
(above f35 f40)
(above f35 f41)
(above f35 f42)
(above f35 f43)
(above f35 f44)
(above f35 f45)
(above f35 f46)
(above f35 f47)
(above f35 f48)
(above f35 f49)
(above f35 f50)
(above f35 f51)
(above f35 f52)
(above f35 f53)

(above f36 f37)
(above f36 f38)
(above f36 f39)
(above f36 f40)
(above f36 f41)
(above f36 f42)
(above f36 f43)
(above f36 f44)
(above f36 f45)
(above f36 f46)
(above f36 f47)
(above f36 f48)
(above f36 f49)
(above f36 f50)
(above f36 f51)
(above f36 f52)
(above f36 f53)

(above f37 f38)
(above f37 f39)
(above f37 f40)
(above f37 f41)
(above f37 f42)
(above f37 f43)
(above f37 f44)
(above f37 f45)
(above f37 f46)
(above f37 f47)
(above f37 f48)
(above f37 f49)
(above f37 f50)
(above f37 f51)
(above f37 f52)
(above f37 f53)

(above f38 f39)
(above f38 f40)
(above f38 f41)
(above f38 f42)
(above f38 f43)
(above f38 f44)
(above f38 f45)
(above f38 f46)
(above f38 f47)
(above f38 f48)
(above f38 f49)
(above f38 f50)
(above f38 f51)
(above f38 f52)
(above f38 f53)

(above f39 f40)
(above f39 f41)
(above f39 f42)
(above f39 f43)
(above f39 f44)
(above f39 f45)
(above f39 f46)
(above f39 f47)
(above f39 f48)
(above f39 f49)
(above f39 f50)
(above f39 f51)
(above f39 f52)
(above f39 f53)

(above f40 f41)
(above f40 f42)
(above f40 f43)
(above f40 f44)
(above f40 f45)
(above f40 f46)
(above f40 f47)
(above f40 f48)
(above f40 f49)
(above f40 f50)
(above f40 f51)
(above f40 f52)
(above f40 f53)

(above f41 f42)
(above f41 f43)
(above f41 f44)
(above f41 f45)
(above f41 f46)
(above f41 f47)
(above f41 f48)
(above f41 f49)
(above f41 f50)
(above f41 f51)
(above f41 f52)
(above f41 f53)

(above f42 f43)
(above f42 f44)
(above f42 f45)
(above f42 f46)
(above f42 f47)
(above f42 f48)
(above f42 f49)
(above f42 f50)
(above f42 f51)
(above f42 f52)
(above f42 f53)

(above f43 f44)
(above f43 f45)
(above f43 f46)
(above f43 f47)
(above f43 f48)
(above f43 f49)
(above f43 f50)
(above f43 f51)
(above f43 f52)
(above f43 f53)

(above f44 f45)
(above f44 f46)
(above f44 f47)
(above f44 f48)
(above f44 f49)
(above f44 f50)
(above f44 f51)
(above f44 f52)
(above f44 f53)

(above f45 f46)
(above f45 f47)
(above f45 f48)
(above f45 f49)
(above f45 f50)
(above f45 f51)
(above f45 f52)
(above f45 f53)

(above f46 f47)
(above f46 f48)
(above f46 f49)
(above f46 f50)
(above f46 f51)
(above f46 f52)
(above f46 f53)

(above f47 f48)
(above f47 f49)
(above f47 f50)
(above f47 f51)
(above f47 f52)
(above f47 f53)

(above f48 f49)
(above f48 f50)
(above f48 f51)
(above f48 f52)
(above f48 f53)

(above f49 f50)
(above f49 f51)
(above f49 f52)
(above f49 f53)

(above f50 f51)
(above f50 f52)
(above f50 f53)

(above f51 f52)
(above f51 f53)

(above f52 f53)



(origin p0 f18)
(destin p0 f28)

(origin p1 f51)
(destin p1 f25)

(origin p2 f42)
(destin p2 f39)

(origin p3 f44)
(destin p3 f12)

(origin p4 f3)
(destin p4 f51)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
))
)

; plan
1. (up f0 f3)
   deleted: (lift-at f0)
   added: (lift-at f3)
   goals met: 0 of 5
2. (board f3 p4)
   added: (boarded p4)
   goals met: 0 of 5
3. (up f3 f51)
   deleted: (lift-at f3)
   added: (lift-at f51)
   goals met: 0 of 5
4. (depart f51 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 1 of 5
5. (board f51 p1)
   added: (boarded p1)
   goals met: 1 of 5
6. (down f51 f42)
   deleted: (lift-at f51)
   added: (lift-at f42)
   goals met: 1 of 5
7. (board f42 p2)
   added: (boarded p2)
   goals met: 1 of 5
8. (down f42 f25)
   deleted: (lift-at f42)
   added: (lift-at f25)
   goals met: 1 of 5
9. (depart f25 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 2 of 5
10. (down f25 f18)
   deleted: (lift-at f25)
   added: (lift-at f18)
   goals met: 2 of 5
11. (board f18 p0)
   added: (boarded p0)
   goals met: 2 of 5
12. (up f18 f28)
   deleted: (lift-at f18)
   added: (lift-at f28)
   goals met: 2 of 5
13. (depart f28 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 3 of 5
14. (up f28 f39)
   deleted: (lift-at f28)
   added: (lift-at f39)
   goals met: 3 of 5
15. (depart f39 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 4 of 5
16. (up f39 f44)
   deleted: (lift-at f39)
   added: (lift-at f44)
   goals met: 4 of 5
17. (board f44 p3)
   added: (boarded p3)
   goals met: 4 of 5
18. (down f44 f12)
   deleted: (lift-at f44)
   added: (lift-at f12)
   goals met: 4 of 5
19. (depart f12 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 5 of 5
